---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Width
zh: 宽度
source: html/ad061c40-7449-df0c-b0d5-52e3bc758458.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Width Property

**中文**: 宽度

The width of the analytical rectangular geometry.

## Syntax (C#)
```csharp
public double Width { get; }
```

## Remarks
The product of width and height should be equal to the area
 of the polyloop for the opening. The width is adjusted to accomplish this.